-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: 58.239.58.243    Database: java501_team3_final
-- ------------------------------------------------------
-- Server version	8.0.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `treat_sale`
--

DROP TABLE IF EXISTS `treat_sale`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `treat_sale` (
  `idx` int NOT NULL AUTO_INCREMENT,
  `create_date` datetime(6) DEFAULT NULL,
  `memo` varchar(500) DEFAULT NULL,
  `content` varchar(255) NOT NULL,
  `payment` varchar(255) NOT NULL,
  `payment_day` varchar(255) NOT NULL,
  `payment_method` varchar(255) NOT NULL,
  `payment_time` varchar(255) NOT NULL,
  `user_name` varchar(255) DEFAULT NULL,
  `user_idx` int DEFAULT '0',
  PRIMARY KEY (`idx`)
) ENGINE=InnoDB AUTO_INCREMENT=116 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `treat_sale`
--

LOCK TABLES `treat_sale` WRITE;
/*!40000 ALTER TABLE `treat_sale` DISABLE KEYS */;
INSERT INTO `treat_sale` VALUES (12,'2024-03-07 05:51:57.843269','','(남성)커트','20000','2024-03-07','cash','10:30:00','김경은',4),(14,'2024-03-07 06:22:08.136916','','(여성)디자인커트, (여성)디자인커트, (여성)커트','50000','2024-03-07','credit','10:30:00','김경은',4),(16,'2024-03-07 07:26:22.013500','','(여성)디자인커트','44444','2024-03-01','cash','10:00:00','이기호',2),(18,'2024-03-07 08:09:31.699906','','(남성)염색','70000','2024-03-07','cash','10:30:00','이기호',2),(19,'2024-03-07 08:10:31.429913','000000','(여성)디자인커트','20000','2024-03-05','cash','10:30:00','이기호',2),(20,'2024-03-07 08:11:22.879725','','(여성)디자인커트, (여성)염색','90000','2024-03-07','credit','10:30:00','문소연',8),(21,'2024-03-07 08:12:11.871506','','(여성)디자인커트','20000','2024-03-07','credit','11:30:00','문소연',8),(22,'2024-03-07 08:17:12.651860','','(여성)염색','70000','2024-03-07','cash','10:30:00','이기호',2),(23,'2024-03-07 11:59:43.961257','','(남성)염색','70000','2024-02-20','cash','16:30:00','김경은',4),(24,'2024-03-07 12:22:08.051679','','(남성)커트','10000','2024-03-06','cash','10:30:00','김경은',4),(25,'2024-03-07 12:22:26.766560','','(여성)커트','10000','2024-03-06','credit','10:30:00','비회원',0),(26,'2024-03-07 12:22:43.546241','','(여성)커트','10000','2024-03-07','credit','10:30:00','문소연',8),(27,'2024-03-07 12:23:33.853484','','(여성)커트','10000','2024-03-06','credit','15:30:00','문소연',8),(28,'2024-03-07 12:24:26.061324','','(남성)커트','10000','2024-03-06','credit','14:30:00','이기호',5),(29,'2024-03-07 13:24:33.270799','','(여성)염색','70000','2024-01-08','cash','10:30:00','김경은',4),(30,'2024-03-07 13:25:10.344125','','(여성)염색, (여성)트리트먼트','170000','2024-01-24','cash','16:30:00','문소연',8),(33,'2024-03-08 16:12:04.605629','','(남성)커트','111111','2024-02-27','cash','13:00:00','윤쌤',20),(34,'2024-03-08 16:16:33.627745','','(남성)디자인커트)','12','2024-03-09','cash','09:00:00','김경은',3),(37,'2024-03-09 11:45:46.114886','','(여성)여성 디자인커트, (남성)염색','90000','2024-02-26','cash','11:30:00','문소연',8),(38,'2024-03-09 13:37:43.273794','','(남성)디자인커트','20000','2024-03-07','cash','12:00:00','김경은',3),(40,'2024-03-10 09:29:19.744875','ㅎㅎ 발싸\r\n','(남성)디자인커트','20000','2024-03-09','cash','15:00:00','이기호',5),(41,'2024-03-10 09:29:44.134009','ㅏㅣㅏㅏ','(남성)디자인커트','20000','2024-03-09','cash','20:00:00','김경은',4),(42,'2024-03-10 09:30:16.081134','','(남성)커트','10000','2024-03-10','cash','08:30:00','이기호',5),(43,'2024-03-10 14:22:16.364158','','(남성)디자인커트','20000','2024-03-10','cash','10:30:00','비회원',0),(57,'2024-03-10 23:08:39.867902','','(남성)커트','10000','2024-03-10','credit','17:30:00','시험용',31),(58,'2024-03-10 23:08:58.396420','','(여성)커트','10000','2024-03-10','credit','19:30:00','김유정',10),(61,'2024-03-10 23:10:24.020319','','(남성)염색','70000','2024-03-01','credit','17:00:00','강태욱',5),(63,'2024-03-10 23:11:16.507586','','(여성)여성 디자인커트','20000','2023-12-24','credit','12:00:00','문소연',4),(64,'2024-03-10 23:11:27.202601','','(여성)여성 디자인커트','20000','2024-01-03','credit','11:00:00','이기호',2),(65,'2024-03-10 23:11:38.290571','','(여성)여성 디자인커트','20000','2024-01-03','cash','11:00:00','이기호',2),(66,'2024-03-10 23:11:47.837381','','(남성)염색','100000','2024-01-11','credit','15:00:00','문소연',4),(67,'2024-03-10 23:11:57.674964','','(여성)여성 디자인커트','20000','2024-01-19','credit','09:00:00','김경은',3),(68,'2024-03-10 23:12:05.862039','','(여성)커트','10000','2024-02-01','cash','11:30:00','곽석철',6),(69,'2024-03-10 23:12:14.955884','','(여성)커트','10000','2024-02-01','credit','11:30:00','곽석철',6),(70,'2024-03-10 23:12:22.595283','','(여성)여성 디자인커트','20000','2024-02-11','credit','10:00:00','김경은',3),(71,'2024-03-10 23:12:30.323610','','(여성)커트','10000','2024-02-15','credit','14:30:00','이기호',2),(72,'2024-03-10 23:12:40.108997','','(남성)염색','70000','2024-03-01','credit','17:00:00','강태욱',5),(109,'2024-03-11 11:15:26.753605','','(여성)여성 디자인커트','20000','2024-03-11','credit','10:00:00','시험용',31),(110,'2024-03-11 11:46:10.817951','','(남성)염색, (남성)커트','120000','2024-03-12','cash','16:30:00','홍길동12',38),(111,'2024-03-11 11:46:34.115050','','(남성)디자인커트, (남성)커트','30000','2024-03-11','cash','12:30:00','비회원',0),(112,'2024-03-11 14:10:54.713021','','(남성)염색','100000','2024-03-11','cash','10:30:00','비회원',0),(113,'2024-03-11 14:11:59.058048','','(여성)여성 디자인커트','20000','2024-03-11','credit','10:00:00','시험용',31),(114,'2024-03-12 09:30:59.231977','','(남성)염색, (남성)디자인커트','120000','2024-03-18','credit','14:00:00','이기호',39),(115,'2024-03-12 09:40:44.405531','','(남성)디자인커트','20000','2024-03-12','credit','08:30:00','이기호',27);
/*!40000 ALTER TABLE `treat_sale` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-03-15 11:57:22
